In [5]:
%load_ext sql
%sql mysql+pymysql://root:YourPassword@localhost/bookstore_joins_project

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### INNER JOIN
Q1: Get all orders with customer names and book titles they purchased.

In [38]:
%%sql 
SELECT
     o.order_id,c.customer_id,c.customer_name,b.title as book_title,oi.quantity,
    o.order_date
FROM 
    orders o
JOIN customers c      ON o.customer_id = c.customer_id
JOIN order_items oi   ON o.order_id = oi.order_id
JOIN books b          ON oi.book_id = b.book_id
ORDER BY o.order_id;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
5 rows affected.

[(1, 1, 'Alice', 'Harry Potter', 1, datetime.date(2025, 10, 1)),
 (1, 1, 'Alice', 'Kafka on the Shore', 1, datetime.date(2025, 10, 1)),
 (2, 2, 'Bob', 'Game of Thrones', 2, datetime.date(2025, 10, 2)),
 (3, 1, 'Alice', 'Norwegian Wood', 1, datetime.date(2025, 10, 3)),
 (4, 3, 'Charlie', 'Fantastic Beasts', 1, datetime.date(2025, 10, 3))]

### LEFT JOIN
Q2: Show all customers and their order IDs — including those who haven’t placed any orders yet.
(You should see NULL in order_id for customers with no orders.)

In [51]:
%%sql 
SELECT
     c.customer_id,c.customer_name,o.order_id
FROM 
     customers c
LEFT JOIN orders o 
    ON o.customer_id = c.customer_id

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
5 rows affected.

[(1, 'Alice', 1),
 (1, 'Alice', 3),
 (2, 'Bob', 2),
 (3, 'Charlie', 4),
 (4, 'Diana', None)]

### RIGHT JOIN
Q3: Display all books with order IDs — including books that have never been ordered.
(Hint: some books may not appear in order_items.)

In [74]:
%%sql 
SELECT
    b.book_id,
    b.title,
    b.genre,
    b.price,
    oi.order_id,
    oi.quantity
FROM order_items oi
RIGHT JOIN books b 
    ON oi.book_id = b.book_id
ORDER BY b.book_id;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
5 rows affected.

[(1, 'Harry Potter', 'Fantasy', Decimal('20.00'), 1, 1),
 (2, 'Game of Thrones', 'Fantasy', Decimal('25.00'), 2, 2),
 (3, 'Kafka on the Shore', 'Fiction', Decimal('18.00'), 1, 1),
 (4, 'Norwegian Wood', 'Romance', Decimal('15.00'), 3, 1),
 (5, 'Fantastic Beasts', 'Fantasy', Decimal('22.00'), 4, 1)]

### FULL OUTER JOIN
Q4: List all customers and all orders, showing matches where available.
(Include customers with no orders and orders with missing customers, if any.)

In [85]:
%%sql 
SELECT
    c.customer_id,
    c.customer_name,
    o.order_id,
    o.order_date
FROM customers c
 JOIN orders o
    ON o.customer_id = c.customer_id

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
4 rows affected.

[(1, 'Alice', 1, datetime.date(2025, 10, 1)),
 (2, 'Bob', 2, datetime.date(2025, 10, 2)),
 (1, 'Alice', 3, datetime.date(2025, 10, 3)),
 (3, 'Charlie', 4, datetime.date(2025, 10, 3))]

### CROSS JOIN
Q5: Generate a list of every possible author–book combination.
(Useful for exploring combinations regardless of actual relationships.)

In [93]:
%%sql 
SELECT
    a.author_id,
    a.author_name,
    b.book_id,
    b.title
FROM authors  a 
CROSS JOIN books b
    ON a.author_id = b.author_id
ORDER BY a.author_id, b.book_id

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
5 rows affected.

[(1, 'J.K. Rowling', 1, 'Harry Potter'),
 (1, 'J.K. Rowling', 5, 'Fantastic Beasts'),
 (2, 'George R.R. Martin', 2, 'Game of Thrones'),
 (3, 'Haruki Murakami', 3, 'Kafka on the Shore'),
 (3, 'Haruki Murakami', 4, 'Norwegian Wood')]

### SELF JOIN
Q6: Find customers who live in the same city as another customer.
(Show customer pairs from the same city.)

In [107]:
%%sql 
SELECT
    c1.customer_id AS customer1_id,
    c1.customer_name AS customer1_name,
    c2.customer_id AS customer2_id,
    c2.customer_name AS customer2_name,
    c1.city
FROM customers c1
JOIN customers c2
    ON c1.city = c2.city
    AND c1.customer_id < c2.customer_id
ORDER BY c1.city;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
1 rows affected.

[(1, 'Alice', 4, 'Diana', 'London')]

### MULTI-TABLE JOIN + AGGREGATE
Q7: Find total quantity of each book sold (book title + total_sold).
(Use SUM(quantity) grouped by book_id.)

In [132]:
%%sql 
SELECT 
    b.book_id,
    b.title,
    SUM(oi.quantity) AS total_sold
FROM books b
JOIN order_items oi 
    ON b.book_id = oi.book_id
GROUP BY b.book_id, b.title
ORDER BY total_sold DESC;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
5 rows affected.

[(2, 'Game of Thrones', Decimal('2')),
 (1, 'Harry Potter', Decimal('1')),
 (3, 'Kafka on the Shore', Decimal('1')),
 (4, 'Norwegian Wood', Decimal('1')),
 (5, 'Fantastic Beasts', Decimal('1'))]

### INNER JOIN + GROUP BY
Q8: Calculate total revenue (quantity × price) per author.
(Join authors → books → order_items; group by author_name.)

In [142]:
%%sql 
SELECT 
    c.customer_id,
    c.customer_name,
    SUM(oi.quantity * b.price) AS total_spent
FROM customers c
JOIN orders o 
    ON c.customer_id = o.customer_id
JOIN order_items oi 
    ON o.order_id = oi.order_id
JOIN books b
    ON oi.book_id = b.book_id
GROUP BY c.customer_id, c.customer_name
ORDER BY total_spent DESC;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
3 rows affected.

[(1, 'Alice', Decimal('53.00')),
 (2, 'Bob', Decimal('50.00')),
 (3, 'Charlie', Decimal('22.00'))]

### LEFT JOIN + FILTER
Q9: Show all customers from ‘London’ and their recent orders (if any).
(Use LEFT JOIN with a WHERE city = 'London' condition.)

In [139]:
%%sql 
SELECT 
    b.book_id,
    b.title,
    b.price
FROM books b
LEFT JOIN order_items oi 
    ON b.book_id = oi.book_id
WHERE oi.order_item_id IS NULL;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
0 rows affected.

[]

### DISTINCT + MULTI-TABLE JOIN
Q10: Find customers who bought at least one Fantasy book.
(Use DISTINCT to avoid duplicates.)

In [137]:
%%sql 
SELECT 
    c.customer_id,
    c.customer_name,
    o.order_id,
    o.order_date
FROM customers c
LEFT JOIN orders o 
    ON c.customer_id = o.customer_id
    AND o.order_date = (
        SELECT MAX(o2.order_date)
        FROM orders o2
        WHERE o2.customer_id = c.customer_id
    )
ORDER BY c.customer_id;

 * mysql+pymysql://root:***@localhost/bookstore_joins_project
   mysql+pymysql://root:***@localhost/qcda
4 rows affected.

[(1, 'Alice', 3, datetime.date(2025, 10, 3)),
 (2, 'Bob', 2, datetime.date(2025, 10, 2)),
 (3, 'Charlie', 4, datetime.date(2025, 10, 3)),
 (4, 'Diana', None, None)]